benchmark_results/results/qwen122b/Qwen_Qwen3.5-122B-A10B-FP8_in20000_out5000_rate25.log
DEBUG 04-13 11:19:56 [plugins/__init__.py:36] No plugins for group vllm.platform_plugins found.
DEBUG 04-13 11:19:56 [platforms/__init__.py:36] Checking if TPU platform is available.
DEBUG 04-13 11:19:56 [platforms/__init__.py:55] TPU platform is not available because: No module named 'libtpu'
DEBUG 04-13 11:19:56 [platforms/__init__.py:61] Checking if CUDA platform is available.
DEBUG 04-13 11:19:56 [platforms/__init__.py:84] Confirmed CUDA platform is available.
DEBUG 04-13 11:19:56 [platforms/__init__.py:112] Checking if ROCm platform is available.
DEBUG 04-13 11:19:56 [platforms/__init__.py:126] ROCm platform is not available because: No module named 'amdsmi'
DEBUG 04-13 11:19:56 [platforms/__init__.py:133] Checking if XPU platform is available.
DEBUG 04-13 11:19:56 [platforms/__init__.py:155] Checking if CPU platform is available.
DEBUG 04-13 11:19:56 [platforms/__init__.py:61] Checking if CUDA platform is available.
DEBUG 04-13 11:19:56 [platforms/__init__.py:84] Confirmed CUDA platform is available.
DEBUG 04-13 11:19:56 [platforms/__init__.py:220] Automatically detected platform cuda.
DEBUG 04-13 11:19:59 [utils/import_utils.py:74] Loading module triton_kernels from /usr/local/lib/python3.12/dist-packages/vllm/third_party/triton_kernels/__init__.py.
DEBUG 04-13 11:20:01 [entrypoints/utils.py:180] Setting VLLM_WORKER_MULTIPROC_METHOD to 'spawn'
DEBUG 04-13 11:20:01 [plugins/__init__.py:44] Available plugins for group vllm.general_plugins:
DEBUG 04-13 11:20:01 [plugins/__init__.py:46] - lora_filesystem_resolver -> vllm.plugins.lora_resolvers.filesystem_resolver:register_filesystem_resolver
DEBUG 04-13 11:20:01 [plugins/__init__.py:46] - lora_hf_hub_resolver -> vllm.plugins.lora_resolvers.hf_hub_resolver:register_hf_hub_resolver
DEBUG 04-13 11:20:01 [plugins/__init__.py:49] All plugins in this group will be loaded. Set `VLLM_PLUGINS` to control which plugins to load.
Namespace(subparser='bench', bench_type='serve', dispatch_function=<function BenchmarkServingSubcommand.cmd at 0x7ff98877f100>, trust_remote_code=False, seed=0, num_prompts=500, dataset_name='random', no_stream=False, dataset_path=None, no_oversample=False, skip_chat_template=False, enable_multimodal_chat=False, disable_shuffle=False, custom_output_len=256, spec_bench_output_len=256, spec_bench_category=None, sonnet_input_len=550, sonnet_output_len=150, sonnet_prefix_len=200, sharegpt_output_len=None, blazedit_min_distance=0.0, blazedit_max_distance=1.0, asr_max_audio_len_sec=inf, asr_min_audio_len_sec=0.0, random_input_len=1024, random_output_len=128, random_range_ratio=0.0, random_prefix_len=0, random_batch_size=1, no_reranker=False, random_mm_base_items_per_request=1, random_mm_num_mm_items_range_ratio=0.0, random_mm_limit_mm_per_prompt={'image': 255, 'video': 1}, random_mm_bucket_config={(256, 256, 1): 0.5, (720, 1280, 1): 0.5, (720, 1280, 16): 0.0}, hf_subset=None, hf_split=None, hf_name=None, hf_output_len=None, prefix_repetition_prefix_len=256, prefix_repetition_suffix_len=256, prefix_repetition_num_prefixes=10, prefix_repetition_output_len=128, label=None, backend='openai', base_url='http://10.29.95.16:8093/vllm-qwen3-5-122b-4', host='127.0.0.1', port=8000, endpoint='/v1/completions', header=None, max_concurrency=25, model='Qwen/Qwen3.5-122B-A10B-FP8', input_len=20000, output_len=5000, tokenizer='/Models/Qwen3.5-122B-A10B-FP8', tokenizer_mode='auto', use_beam_search=False, logprobs=None, request_rate=inf, burstiness=1.0, disable_tqdm=False, num_warmups=0, profile=False, save_result=False, save_detailed=False, append_result=False, metadata=None, result_dir=None, result_filename=None, ignore_eos=False, percentile_metrics=None, metric_percentiles='99', goodput=None, request_id_prefix='bench-b53bd6f6-', top_p=None, top_k=None, min_p=None, temperature=None, frequency_penalty=None, presence_penalty=None, repetition_penalty=None, served_model_name=None, lora_modules=None, ramp_up_strategy=None, ramp_up_start_rps=None, ramp_up_end_rps=None, ready_check_timeout_sec=0, extra_body=None, skip_tokenizer_init=False, insecure=False, plot_timeline=False, timeline_itl_thresholds=[25.0, 50.0], plot_dataset_stats=False)
DEBUG 04-13 11:20:01 [tokenizers/registry.py:67] Loading CachedHfTokenizer for tokenizer_mode='hf'
INFO 04-13 11:20:01 [benchmarks/datasets.py:631] Sampling input_len from [20000, 20000] and output_len from [5000, 5000]
WARNING: vllm bench serve no longer sets temperature==0 (greedy) in requests by default. The default will be determined on the server side and can be model/API specific. For the old behavior, include --temperature=0.
Starting initial single prompt test run...
Skipping endpoint ready check.
Starting main benchmark run...
Traffic request rate: inf
Burstiness factor: 1.0 (Poisson process)
Maximum request concurrency: 25
100%|██████████| 500/500 [33:29<00:00,  4.02s/it]
tip: install termplotlib and gnuplot to plot the metrics
============ Serving Benchmark Result ============
Successful requests:                     500       
Failed requests:                         0         
Maximum request concurrency:             25        
Benchmark duration (s):                  2009.47   
Total input tokens:                      10000000  
Total generated tokens:                  2500000   
Request throughput (req/s):              0.25      
Output token throughput (tok/s):         1244.11   
Peak output token throughput (tok/s):    1575.00   
Peak concurrent requests:                30.00     
Total token throughput (tok/s):          6220.56   
---------------Time to First Token----------------
Mean TTFT (ms):                          2757.48   
Median TTFT (ms):                        2545.36   
P99 TTFT (ms):                           13742.24  
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          19.54     
Median TPOT (ms):                        19.57     
P99 TPOT (ms):                           20.30     
---------------Inter-token Latency----------------
Mean ITL (ms):                           19.55     
Median ITL (ms):                         17.19     
P99 ITL (ms):                            141.58    
==================================================